minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32S3_CAM/VisionBot_ESP32S3_CAM.ino
  Serial.begin(115200);
  delay(1000);

  generateDeviceId();
  ensureSetupPassword();
  loadDeviceConfig();
  printBootInfo();

  setupPins();

  bool wifiOk = startConfigPortalIfNeeded();
  if (!wifiOk) return;

  cameraReady = initCamera();

  cameraWs.begin();
  cameraWs.onEvent(cameraWsEvent);
  Serial.println("Camera WebSocket started on port 86.");
  Serial.println("Camera stream URL: " + getStreamUrl());

  setupHttpServer();

  setupMqttClient();
  if (!connectMqtt()) {
    recordMqttFailureAndKeepRunning();
  }

  publishSecurityEvent("boot", "device booted");
  publishState(true);

  Serial.println();
  Serial.println("=== Runtime ready ===");
  Serial.println("Device ID: " + deviceId);
  Serial.println("HTTP API: " + getHttpBase());
  Serial.println("Stream: " + getStreamUrl());
  Serial.println("MQTT state: " + mqttTopic("state"));
  Serial.println("MQTT drive: " + mqttTopic("cmd/drive"));
  Serial.println("MQTT servo: " + mqttTopic("cmd/servo"));
  Serial.println("MQTT stop: " + mqttTopic("cmd/stop"));
  Serial.println();
  Serial.println("Serial fallback:");
  Serial.println("f/b/l/r/s = motor, e = estop, 0/1/2 = servo, ? = status, x = reset config");
}

void loop() {
  httpServer.handleClient();

  cameraWs.loop();
  streamCameraFrame();

  maintainWifiRecoveryPortal();
  maintainMqtt();

  if (Serial.available()) {
    char c = Serial.read();
    handleSerialCommand(c);
  }

  // Motor command TTL / watchdog
  if (motorActive && millis() - lastMotorCommandMs > currentCommandTtlMs) {
    motorStop();
    publishSecurityEvent("motor_watchdog_stop", "command TTL expired", "warn");
    publishTelemetry();
  }

  // Telemetry
  if (millis() - lastTelemetryMs > cfg.telemetryIntervalMs) {
    lastTelemetryMs = millis();
    publishTelemetry();
  }

  // Retained dynamic state / IP announce
  if (millis() - lastStateMs > STATE_INTERVAL_MS) {
    lastStateMs = millis();
    publishState(true);
  }
}
